test/multiphase/multiphaseEulerFoam/interfaceComposition/waterEvaporation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    interfaceCompositionPhaseChangeMultiphaseSystem;

phases (gas liquid);

nInterfaceCorrectors 1;

gas
{
    type            multiComponentPhaseModel;
    diameterModel   none;
    residualAlpha   1e-6;
    Sct             0.7;
}

liquid
{
    type            purePhaseModel;
    diameterModel   constant;
    d               5e-4;
    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           gas;
    }
}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{}

virtualMass
{}

interfaceComposition
{
    gas_liquid_inThe_gas
    {
        type saturated;
        species ( H2O );
        Le 1.0;
        saturationPressure
        {
            type ArdenBuck;
        }
    }
}

heatTransfer
{
    liquid_dispersedIn_gas_inThe_gas
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    liquid_dispersedIn_gas_inThe_liquid
    {
        type spherical;
        residualAlpha 1e-4;
    }
}

diffusiveMassTransfer
{
    liquid_dispersedIn_gas_inThe_gas
    {
        type Frossling;
        Le 1.0;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
